In [1]:
import pandas as pd
import numpy as np

In [2]:
train = pd.read_csv("train.csv")

In [3]:
train.head()

   id        date  store_nbr      family  sales  onpromotion
0   0  2013-01-01          1  AUTOMOTIVE    0.0            0
1   1  2013-01-01          1   BABY CARE    0.0            0
2   2  2013-01-01          1      BEAUTY    0.0            0
3   3  2013-01-01          1   BEVERAGES    0.0            0
4   4  2013-01-01          1       BOOKS    0.0            0

In [4]:
test = pd.read_csv("test.csv")

In [5]:
test.head()

        id        date  store_nbr      family  onpromotion
0  3000888  2017-08-16          1  AUTOMOTIVE            0
1  3000889  2017-08-16          1   BABY CARE            0
2  3000890  2017-08-16          1      BEAUTY            2
3  3000891  2017-08-16          1   BEVERAGES           20
4  3000892  2017-08-16          1       BOOKS            0

In [6]:
df = train.append(test,ignore_index=True)

C:\Users\Administrator\AppData\Local\Temp\ipykernel_3288\954760958.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = train.append(test,ignore_index=True)

In [7]:
df.head()

   id        date  store_nbr      family  sales  onpromotion
0   0  2013-01-01          1  AUTOMOTIVE    0.0            0
1   1  2013-01-01          1   BABY CARE    0.0            0
2   2  2013-01-01          1      BEAUTY    0.0            0
3   3  2013-01-01          1   BEVERAGES    0.0            0
4   4  2013-01-01          1       BOOKS    0.0            0

In [8]:
oil = pd.read_csv("oil.csv")

In [9]:
stores = pd.read_csv("stores.csv")

In [10]:
transactions = pd.read_csv("transactions.csv")

In [11]:
holiday = pd.read_csv("holidays_events.csv")

# OIL CSV

In [12]:
oil[oil['date']==oil['date'].min()]

         date  dcoilwtico
0  2013-01-01         NaN

In [13]:
len(oil['date'].unique())

1218

In [14]:
df['date'].max()

'2017-08-31'

In [15]:
df['date'].min()

'2013-01-01'

In [16]:
len(df['date'].unique())

1700

In [17]:
oil['date'] = pd.to_datetime(oil['date'], format='%Y/%m/%d')

In [18]:
df['date'] = pd.to_datetime(df['date'], format='%Y/%m/%d')

In [19]:
df = pd.merge(df,oil,on='date',how='left')

In [20]:
df = df.sort_values('date')

In [21]:
df.head(10)

,id,date,store_nbr,family,sales,onpromotion,dcoilwtico
0,0,2013-01-01,1,AUTOMOTIVE,0.0,0,NaN
1194,1194,2013-01-01,42,CELEBRATION,0.0,0,NaN
1193,1193,2013-01-01,42,BREAD/BAKERY,0.0,0,NaN
1192,1192,2013-01-01,42,BOOKS,0.0,0,NaN
1191,1191,2013-01-01,42,BEVERAGES,0.0,0,NaN
1190,1190,2013-01-01,42,BEAUTY,0.0,0,NaN
1189,1189,2013-01-01,42,BABY CARE,0.0,0,NaN
1188,1188,2013-01-01,42,AUTOMOTIVE,0.0,0,NaN
1187,1187,2013-01-01,41,SEAFOOD,0.0,0,NaN
1186,1186,2013-01-01,41,SCHOOL AND OFFICE SUPPLIES,0.0,0,NaN

In [22]:
df['dcoilwtico'] = df['dcoilwtico'].interpolate(method='linear')

In [23]:
df[df['date']=='2013-01-02'].iloc[0]['dcoilwtico']

93.14

In [24]:
df[df['date']=='2013-01-03'].iloc[0]['dcoilwtico']

92.97

In [25]:
df[df['date']=='2013-01-04'].iloc[0]['dcoilwtico']

93.12

In [26]:
df[df['date']=='2013-01-05'].iloc[0]['dcoilwtico']

93.12002244039272

In [27]:
df[df['date']=='2013-01-06'].iloc[0]['dcoilwtico']

93.16001122019635

In [28]:
df[df['dcoilwtico'].isna()]['date']

0      2013-01-01
1194   2013-01-01
1193   2013-01-01
1192   2013-01-01
1191   2013-01-01
          ...
589    2013-01-01
588    2013-01-01
587    2013-01-01
586    2013-01-01
597    2013-01-01
Name: date, Length: 1782, dtype: datetime64[ns]

# Object of Change : 93

In [29]:
df['dcoilwtico'] = df['dcoilwtico'].fillna(93)

# Stores

In [30]:
df.head()

        id       date  store_nbr        family  sales  onpromotion  dcoilwtico
0        0 2013-01-01          1    AUTOMOTIVE    0.0            0        93.0
1194  1194 2013-01-01         42   CELEBRATION    0.0            0        93.0
1193  1193 2013-01-01         42  BREAD/BAKERY    0.0            0        93.0
1192  1192 2013-01-01         42         BOOKS    0.0            0        93.0
1191  1191 2013-01-01         42     BEVERAGES    0.0            0        93.0

In [31]:
stores.head()

   store_nbr           city                           state type  cluster
0          1          Quito                       Pichincha    D       13
1          2          Quito                       Pichincha    D       13
2          3          Quito                       Pichincha    D        8
3          4          Quito                       Pichincha    D        9
4          5  Santo Domingo  Santo Domingo de los Tsachilas    D        4

In [32]:
df = pd.merge(df,stores,on='store_nbr',how='left')

In [33]:
df.head()

,id,date,store_nbr,family,sales,onpromotion,dcoilwtico,city,state,type,cluster
0,0,2013-01-01,1,AUTOMOTIVE,0.0,0,93.0,Quito,Pichincha,D,13
1,1194,2013-01-01,42,CELEBRATION,0.0,0,93.0,Cuenca,Azuay,D,2
2,1193,2013-01-01,42,BREAD/BAKERY,0.0,0,93.0,Cuenca,Azuay,D,2
3,1192,2013-01-01,42,BOOKS,0.0,0,93.0,Cuenca,Azuay,D,2
4,1191,2013-01-01,42,BEVERAGES,0.0,0,93.0,Cuenca,Azuay,D,2

In [34]:
print(len(df['city'].unique()))
df['city'].unique()

22

array(['Quito', 'Cuenca', 'Machala', 'Esmeraldas', 'Libertad', 'Playas',
       'Guayaquil', 'Loja', 'El Carmen', 'Manta', 'Ambato',
       'Santo Domingo', 'Quevedo', 'Guaranda', 'Ibarra', 'Cayambe',
       'Latacunga', 'Riobamba', 'Babahoyo', 'Puyo', 'Daule', 'Salinas'],
      dtype=object)

In [35]:
print(len(df['state'].unique()))
df['state'].unique()

16

array(['Pichincha', 'Azuay', 'El Oro', 'Esmeraldas', 'Guayas', 'Loja',
       'Manabi', 'Tungurahua', 'Santo Domingo de los Tsachilas',
       'Los Rios', 'Bolivar', 'Imbabura', 'Cotopaxi', 'Chimborazo',
       'Pastaza', 'Santa Elena'], dtype=object)

In [36]:
df['type'].unique()

array(['D', 'E', 'C', 'A', 'B'], dtype=object)

In [37]:
len(df)

3029400

## City is Dropped v1

In [38]:
city = df['city']

In [39]:
df = df.drop(columns=['city'])

# City Dummy v2

In [40]:
#df = pd.concat([df, pd.get_dummies(df['city'], prefix='city',drop_first=True, dtype=float)], axis=1)

In [41]:
#df = df.drop('city', axis=1)

## Type : Dummy

In [42]:
df = pd.concat([df, pd.get_dummies(df['type'], prefix='type',drop_first=True, dtype=float)], axis=1)

In [43]:
df = df.drop('type', axis=1)

## State : Dummy

In [44]:
df = pd.concat([df, pd.get_dummies(df['state'], prefix='state',drop_first=True, dtype=float)], axis=1)

In [45]:
df = df.drop('state',axis=1)

In [46]:
df.head()

,id,date,store_nbr,family,sales,onpromotion,dcoilwtico,cluster,type_B,type_C,...,state_Guayas,state_Imbabura,state_Loja,state_Los Rios,state_Manabi,state_Pastaza,state_Pichincha,state_Santa Elena,state_Santo Domingo de los Tsachilas,state_Tungurahua
0,0,2013-01-01,1,AUTOMOTIVE,0.0,0,93.0,13,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0
1,1194,2013-01-01,42,CELEBRATION,0.0,0,93.0,2,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,1193,2013-01-01,42,BREAD/BAKERY,0.0,0,93.0,2,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,1192,2013-01-01,42,BOOKS,0.0,0,93.0,2,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,1191,2013-01-01,42,BEVERAGES,0.0,0,93.0,2,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

# transactions CSV

In [47]:
len(transactions['store_nbr'].unique())

54

In [48]:
len(df['store_nbr'].unique())

54

In [49]:
transactions.head()

         date  store_nbr  transactions
0  2013-01-01         25           770
1  2013-01-02          1          2111
2  2013-01-02          2          2358
3  2013-01-02          3          3487
4  2013-01-02          4          1922

In [50]:
transactions['date'] = pd.to_datetime(transactions['date'])

In [51]:
df = pd.merge(df, transactions, on=['date', 'store_nbr'],how='left')

In [52]:
df

,id,date,store_nbr,family,sales,onpromotion,dcoilwtico,cluster,type_B,type_C,...,state_Imbabura,state_Loja,state_Los Rios,state_Manabi,state_Pastaza,state_Pichincha,state_Santa Elena,state_Santo Domingo de los Tsachilas,state_Tungurahua,transactions
0,0,2013-01-01,1,AUTOMOTIVE,0.0,0,93.00,13,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,NaN
1,1194,2013-01-01,42,CELEBRATION,0.0,0,93.00,2,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,NaN
2,1193,2013-01-01,42,BREAD/BAKERY,0.0,0,93.00,2,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,NaN
3,1192,2013-01-01,42,BOOKS,0.0,0,93.00,2,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,NaN
4,1191,2013-01-01,42,BEVERAGES,0.0,0,93.00,2,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3029395,3028205,2017-08-31,25,PET SUPPLIES,NaN,0,47.26,1,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,NaN
3029396,3028204,2017-08-31,25,PERSONAL CARE,NaN,6,47.26,1,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,NaN
3029397,3028203,2017-08-31,25,MEATS,NaN,1,47.26,1,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,NaN
3029398,3028214,2017-08-31,26,BEAUTY,NaN,1,47.26,10,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,NaN
3029399,3029399,2017-08-31,9,SEAFOOD,NaN,0,47.26,6,1.0,0.0,...,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,NaN

# Holiday CSV

In [53]:
holiday['type'].unique()

array(['Holiday', 'Transfer', 'Additional', 'Bridge', 'Work Day', 'Event'],
      dtype=object)

In [54]:
holiday['locale_name'].unique()

array(['Manta', 'Cotopaxi', 'Cuenca', 'Libertad', 'Riobamba', 'Puyo',
       'Guaranda', 'Imbabura', 'Latacunga', 'Machala', 'Santo Domingo',
       'El Carmen', 'Cayambe', 'Esmeraldas', 'Ecuador', 'Ambato',
       'Ibarra', 'Quevedo', 'Santo Domingo de los Tsachilas',
       'Santa Elena', 'Quito', 'Loja', 'Salinas', 'Guayaquil'],
      dtype=object)

In [55]:
holiday[(holiday['type']=='Transfer')]['transferred']

20     False
73     False
136    False
256    False
265    False
269    False
298    False
304    False
313    False
325    False
329    False
342    False
Name: transferred, dtype: bool

In [56]:

conditions = [
    ((holiday['type'] == 'Holiday') & (holiday['transferred'] == False)),
    ((holiday['type'] == 'Holiday') & (holiday['transferred'] == True)),
    ((holiday['type'] == 'Event') & (holiday['transferred'] == False)),
    ((holiday['type'] == 'Event') & (holiday['transferred'] == True)),
    (holiday['type'] == 'Transfer'),
    (holiday['type'] == 'Additional'),
    (holiday['type'] == 'Bridge'),
    (holiday['type'] == 'Work Days')
]

choices = [0, 1, 0, 1, 0, 0, 0, 1]

holiday['final'] = np.select(conditions, choices, default=np.nan)

In [57]:
holiday['locale'].unique()

array(['Local', 'Regional', 'National'], dtype=object)

In [58]:
holiday.head()

,date,type,locale,locale_name,description,transferred,final
0,2012-03-02,Holiday,Local,Manta,Fundacion de Manta,False,0.0
1,2012-04-01,Holiday,Regional,Cotopaxi,Provincializacion de Cotopaxi,False,0.0
2,2012-04-12,Holiday,Local,Cuenca,Fundacion de Cuenca,False,0.0
3,2012-04-14,Holiday,Local,Libertad,Cantonizacion de Libertad,False,0.0
4,2012-04-21,Holiday,Local,Riobamba,Cantonizacion de Riobamba,False,0.0

In [59]:
holiday2 = holiday.copy()

In [60]:
holiday2 = holiday2.drop(columns=['description','transferred','locale_name'])

In [61]:
holiday2['date'] = pd.to_datetime(holiday2['date'])

In [62]:
df['transactions'].unique()

array([  nan,  770.,  915., ..., 4553., 4400., 4392.])

In [63]:
df.columns

Index(['id', 'date', 'store_nbr', 'family', 'sales', 'onpromotion',
       'dcoilwtico', 'cluster', 'type_B', 'type_C', 'type_D', 'type_E',
       'state_Bolivar', 'state_Chimborazo', 'state_Cotopaxi', 'state_El Oro',
       'state_Esmeraldas', 'state_Guayas', 'state_Imbabura', 'state_Loja',
       'state_Los Rios', 'state_Manabi', 'state_Pastaza', 'state_Pichincha',
       'state_Santa Elena', 'state_Santo Domingo de los Tsachilas',
       'state_Tungurahua', 'transactions'],
      dtype='object')

In [64]:
df['transactions'] = df['transactions'].fillna(0)

In [65]:
df = pd.merge(df,holiday2, on='date',how='left')

In [66]:
df['type'] = df['type'].fillna('Normal')

In [67]:
def fill_nan_weekday_weekend(row):
    if row['date'].weekday() < 5:
        if pd.isnull(row['final']):
            return 0
    else:
        if pd.isnull(row['final']):
            return 1
    return row['final']

df['final'] = df.apply(lambda row: fill_nan_weekday_weekend(row), axis=1)

In [68]:
df['final'].unique()

array([0., 1.])

In [69]:
df = df.drop(columns=['type','locale'])

In [70]:
df

,id,date,store_nbr,family,sales,onpromotion,dcoilwtico,cluster,type_B,type_C,...,state_Loja,state_Los Rios,state_Manabi,state_Pastaza,state_Pichincha,state_Santa Elena,state_Santo Domingo de los Tsachilas,state_Tungurahua,transactions,final
0,0,2013-01-01,1,AUTOMOTIVE,0.0,0,93.00,13,0.0,0.0,...,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0
1,1194,2013-01-01,42,CELEBRATION,0.0,0,93.00,2,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,1193,2013-01-01,42,BREAD/BAKERY,0.0,0,93.00,2,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,1192,2013-01-01,42,BOOKS,0.0,0,93.00,2,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,1191,2013-01-01,42,BEVERAGES,0.0,0,93.00,2,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3082855,3028205,2017-08-31,25,PET SUPPLIES,NaN,0,47.26,1,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0
3082856,3028204,2017-08-31,25,PERSONAL CARE,NaN,6,47.26,1,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0
3082857,3028203,2017-08-31,25,MEATS,NaN,1,47.26,1,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0
3082858,3028214,2017-08-31,26,BEAUTY,NaN,1,47.26,10,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3082859,3029399,2017-08-31,9,SEAFOOD,NaN,0,47.26,6,1.0,0.0,...,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0

In [71]:
df[df['store_nbr']==1]

,id,date,store_nbr,family,sales,onpromotion,dcoilwtico,cluster,type_B,type_C,...,state_Loja,state_Los Rios,state_Manabi,state_Pastaza,state_Pichincha,state_Santa Elena,state_Santo Domingo de los Tsachilas,state_Tungurahua,transactions,final
0,0,2013-01-01,1,AUTOMOTIVE,0.0,0,93.00,13,0.0,0.0,...,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0
1171,24,2013-01-01,1,MEATS,0.0,0,93.00,13,0.0,0.0,...,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0
1172,23,2013-01-01,1,MAGAZINES,0.0,0,93.00,13,0.0,0.0,...,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0
1173,22,2013-01-01,1,"LIQUOR,WINE,BEER",0.0,0,93.00,13,0.0,0.0,...,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0
1174,21,2013-01-01,1,LINGERIE,0.0,0,93.00,13,0.0,0.0,...,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3082295,3027649,2017-08-31,1,SCHOOL AND OFFICE SUPPLIES,NaN,0,47.26,13,0.0,0.0,...,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0
3082296,3027648,2017-08-31,1,PRODUCE,NaN,3,47.26,13,0.0,0.0,...,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0
3082297,3027647,2017-08-31,1,PREPARED FOODS,NaN,0,47.26,13,0.0,0.0,...,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0
3082298,3027646,2017-08-31,1,POULTRY,NaN,0,47.26,13,0.0,0.0,...,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0
3082299,3027645,2017-08-31,1,PLAYERS AND ELECTRONICS,NaN,0,47.26,13,0.0,0.0,...,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0

In [72]:
df['store_nbr'].unique()

array([ 1, 42, 41, 43, 40,  4, 45, 44, 46, 36, 35, 37, 34, 39, 38, 54,  6,
       53, 52,  9,  8,  7, 48, 49, 47, 51, 50,  5, 33, 18, 17, 19, 16, 15,
       20,  2, 21, 11, 10, 12, 14, 13,  3, 30, 29, 28, 32, 31, 23, 24, 22,
       27, 26, 25], dtype=int64)

## family : Dummy

In [73]:
len(df['family'].unique())

33

In [74]:
df = pd.concat([df, pd.get_dummies(df['family'], prefix='family',drop_first=True, dtype=float)], axis=1)

In [75]:
df = df.drop('family',axis=1)

# Saving Dataset

In [77]:
df = df.drop(columns=['date'])

In [78]:
df1 = df[df['sales'].notnull()]

In [79]:
df2 = df[df['sales'].isnull()]

In [80]:
df1.to_csv('train_1.csv',index=False)

In [81]:
df2.to_csv('test_1.csv',index=False)